use Luncher;

SET FOREIGN_KEY_CHECKS = 0; 
TRUNCATE theme; 
SET FOREIGN_KEY_CHECKS = 1;

-- -------------------------------------------------------
-- 						Football
-- -------------------------------------------------------

CALL Create_Theme 
(
'Football',
'Vive le football',
'S622319')
;


-- -------------------------------------------------------
-- 						Basketball
-- -------------------------------------------------------

CALL Create_Theme 
(
'Basketball',
'Vive le basketball',
'S622319')
;


-- -------------------------------------------------------
-- 						Natation
-- -------------------------------------------------------

CALL Create_Theme 
(
'Natation',
'Vive la natation',
'S622319')
;


-- -------------------------------------------------------
-- 						Films romantiques
-- -------------------------------------------------------

CALL Create_Theme 
(
'Films romantiques',
'Vive les films romantiques',
'S622319')
;


-- -------------------------------------------------------
-- 						Musique
-- -------------------------------------------------------

CALL Create_Theme 
(
'Musique',
'Vive la musique',
'S622319')
;


-- -------------------------------------------------------
-- 						Technologie
-- -------------------------------------------------------

CALL Create_Theme 
(
'Technologie',
'Vive la technologie',
'S622319')
;


-- -------------------------------------------------------
-- 						Lecture
-- -------------------------------------------------------

CALL Create_Theme 
(
'Lecture',
'Vive la lecture',
'S622319')
;


-- -------------------------------------------------------
-- 						Jeux vidéo
-- -------------------------------------------------------

CALL Create_Theme 
(
'Jeux vidéo',
'Vive les jeux vidéo',
'S622319')
;

-- -------------------------------------------------------
-- 						Musique électronique
-- -------------------------------------------------------

CALL Create_Theme 
(
'Musique électronique',
'Vive la musique électronique',
'S1')
;

-- -------------------------------------------------------
-- 						 Randonnée
-- -------------------------------------------------------

CALL Create_Theme 
(
'Randonnée',
'Vive la Randonnée',
'S1')
;

-- -------------------------------------------------------
-- 						 Films d’auteur
-- -------------------------------------------------------

CALL Create_Theme 
(
'Films d’auteur',
'Vive les Films d’auteur',
'S1')
;

-- -------------------------------------------------------
-- 						Sortir à Paris
-- -------------------------------------------------------

CALL Create_Theme 
(
'Sortir à Paris',
'Vive les Sorties à Paris',
'S1')
;

-- -------------------------------------------------------
-- 						Voyages
-- -------------------------------------------------------

CALL Create_Theme 
(
'Voyage',
'Vive les Voyages',
'S1')
;


